# Importing, Reading and Manipulating Data with ACTUAL LITERAL PANDAS

![I have no idea what I'm doing panda](https://cdn-images-1.medium.com/max/1600/1*oBx032ncOwLmCFX3Epo3Zg.jpeg)

Just kidding - but Pandas is a great library to work with relational data.

[Check out the documentation!](https://pandas.pydata.org/pandas-docs/stable/) (always a great idea)

We'll be using the Titanic dataset - you can find this in many places, including [here on Kaggle](https://www.kaggle.com/c/titanic).

In [1]:
# Imports! Can't use pandas unless we bring it into our notebook
import pandas as pd

In [2]:
!ls data/

titanic.csv

In [3]:
# So... how do we access our data?
# I've provided the path - replace None with appropriate code
PATH = "data/titanic.csv"

df = pd.read_csv(PATH)

Let's take a minute to explore that `read_csv` function (and practice reading/exploring documentation): https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_csv.html

In [4]:
# Code here to check out the first few rows
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
# Code here to check the shape of the dataframe
df.shape

(891, 12)

In [6]:
# Code here to check the size of the dataframe
df.size

10692

In [7]:
# Code here to check information on the dataframe
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [8]:
df[['Name','Sex','Ticket','Cabin','Embarked']].describe()

                                  Name   Sex Ticket        Cabin Embarked
count                              891   891    891          204      889
unique                             891     2    681          147        3
top     Nirva, Mr. Iisakki Antino Aijo  male   1601  C23 C25 C27        S
freq                                 1   577      7            4      644

In [9]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [ ]:
# Code here to check the description of some columns

In [ ]:
# Can explore describe further

Questions to ask yourself:

- What is this data capturing?
- What can we quickly learn about the data?
- Are there any empty cells? How can I tell?
- What are the datatypes of the data?

**Note:** You see that some of the ways we dealt with our dataframe required `()` and some did not - why is that? 

-

### Exploring our "Target"

In [ ]:
# Explore the 'Survived' column

In [ ]:
# What are the values of that column?

In [ ]:
# Let's look at the mean of the 'Survived' column

What does looking at the mean of a boolean column like this actually tell us, in practical terms?

### Subsetting the Data

In [ ]:
# Let's explore subsetting the data based on gender

In [ ]:
# Create a df_female dataframe with all females

In [ ]:
# Create a df_male dataframe with all males

In [ ]:
# Find the mean of the 'Survived' column for 2 new dfs

What does this tell us about the diffences between men and women on the Titanic?

 -

Now, we can do the same for age and segment between adults and children (whether they're older or younger than 18) - but, remember, the 'Age' column has `NaN` values:

In [ ]:
# Check for nulls in the 'Age' column

In [ ]:
# How many total nulls do we have?

In [ ]:
# What percentage of the column is null?

In [ ]:
# What to do with null values?

In [ ]:
# Sanity Check! Always worthwhile to check your work to make sure it changed

You'll see these ages are floats... but why? Aren't they all whole numbers? How can we check?

In [ ]:
# Check the age column

How could we make them integers? Two ways to come to mind - let's explore them, and how they're different.

In [ ]:
# Way number 1

In [ ]:
#Way number 2

Now let's explore how age affects our target variable:

In [ ]:
# Create a df for those younger than 18

In [ ]:
# And a df for those 18 or older

In [ ]:
# And let's see how that changes our 'target'